In [1]:
import pandas as pd
import pandasql

from pandasql import sqldf 
sql_run = lambda q: sqldf(q, globals())

## Find the 3rd Highest Salary

You will be given a table. 

The table has 2 columns: `employee`, and `salary`.

Please output the 3rd Highest Salary! 


#### Example 1:
| employee | salary |
| --- | --- |
| Abdul | 100 |
| Budi| 200 |
| Charlie | 100 |
| Dimas | 500 |

#### Answer 1: 
`100`

Yup. Just output the 3rd highest salary. Please, do NOT give any Employee Name, do NOT give duplicate values. We know that 100 is the 3rd Highest Salary, and there are 2 Employees whose salary is 100. But we just care about the VALUE of the 3rd highest salary. Once again, no need to write duplicate values, no need to write the employee name

In [2]:
employee_table = pd.DataFrame({
    'employee':['Alice', 'Benn', 'Charles', 'Dorothy', 'Emma', 'Franklin'],
    'salary':[11,43,33,55,22,33]
})

In [3]:
query = """
SELECT DISTINCT Salary
FROM
(SELECT Salary,DENSE_RANK() OVER(ORDER BY Salary desc) Rank from employee_table)
WHERE Rank=3
"""
sql_run(query)

   Salary
0      33

In [4]:
query = """
SELECT salary 
FROM employee_table
ORDER BY salary DESC
LIMIT 1 OFFSET 2
"""

sql_run(query)

   salary
0      33

## Find Items Bought

Given table with 2 columns: `buyer` and `item`.
- Buyer contains the name of buyer
- Item contains the name of item bought

Return the name of items that is neither bought the most, nor bought the least.

For example:

#### Example 1:

| buyer | item |
| --- | --- |
| Abdul | iPhone |
| Budi| Samsung |
| Charlie | Realme |
| Dimas | Realme |
| Erik | Samsung |
| Fikri | Realme |

Explanation:
- iPhone is bought 1 times.
- Samsung is bought 2 times.
- Realme is bought 3 times.

What is the item that is bought the most? Realme
What is the item that is bought the least? iPhone

So, what is the item that is NOT bought the most, and NOT bought the last? Samsung.

Your answer will be:

| item |
| --- |
| Samsung |

In [5]:
item_bought = pd.DataFrame({
    'buyer':['A', 'B', 'C', 'D', 'E', 'F'],
    'item':['Asus', 'Lenovo', 'Lenovo', 'Acer', 'Acer', 'Acer']
})

In [7]:
query = """
SELECT item
FROM item_bought
GROUP BY item
HAVING COUNT(*) != (SELECT COUNT(*) FROM item_bought GROUP BY item ORDER BY COUNT(*) DESC LIMIT 1) 
AND COUNT(*) != (SELECT COUNT(*) FROM item_bought GROUP BY item ORDER BY COUNT(*) ASC LIMIT 1)
"""

sql_run(query)

     item
0  Lenovo

In [8]:
query = """
SELECT item
FROM item_bought
GROUP BY item
HAVING COUNT(*) = 2
"""
sql_run(query)

     item
0  Lenovo